app/controllers/contact_controller.rb

	def create
		@contact = Contact.new contact_params
		if @contact.save
---
INSERT INTO "contacts" ("name", "email", "contact_number", "subject", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"